# Задание 2

variable = int(input("Сколько всего журавликов? ---> "))
katya = int(variable - variable / 3)
petyaSerg = int(variable / 3 / 2)

print(f"{petyaSerg}, {katya}, {petyaSerg}")