INSERT INTO Skill(name)
VALUES
 ('Голос'),
 ('Танец'),
 ('Прыжок'),
 ('Крутиться'),
 ('Ждать');

INSERT INTO Type (name)
VALUES
 ('Вьючные животные'),
 ('Домашние животные');

INSERT INTO View (name, group_id)
VALUES
 ('Лошадь', 1),
 ('Верблюд', 1),
 ('Осел', 1),
 ('Кошка', 2),
 ('Собака', 2),
 ('Хомяк', 2);
 
INSERT INTO Animal (name, birthDate, view_id)
VALUES
 ('Белый', '2022-06-01', 1),
 ('Черный', '2021-09-03', 1),
 ('Синий', '2021-12-20', 3),
 ('Розовый', '2021-07-14', 2),
 ('Коричневый', '2022-03-20', 5),
 ('Ватник', '2023-08-17', 6),
 ('Луна', '2021-11-23', 4);
 
INSERT INTO AnimalSkill (animal_id, skill_id)
VALUES
 (1, 3), (2, 3), (2, 4), (3, 4),
 (4, 5), (5, 1), (5, 4), (6, 2),
 (7, 1);