# Задача 
 >Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. 
 Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, 
 лучше обойтись исключительно массивами.

### Примеры:
>[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []
## Решение
Для выполнения задания создаю массив
```
string[] originalArray { "День", "Ночь", "Три", "Пять", "Лак", "Краска", "Бык", "Як", "Зеленка", "Йод" };
```
Передаем массив ```originalArray``` функции ```newArrayOnLength``` и записываем результат в новый массив ```finishedArray```
```
string[] finishedArray = newArrayOnLenghth(originalArray);
```
### Описание функции
Cоздаем переменную которая будет определять длинну нового массива
```
int ArrayLength = 0;
```
Используя цикл ```For``` перебираем массив ```originalArray```, отдавая каждый элемент методу ```Length``` таким образом определяя длинну каждого элемента для дальнейшей сортировки с помощью ```if``` и прибавляем единицу в аргумент ```ArrayLength``` за каждый элемент состоящий из трех или менее символов.
```
for (int i = 0; i < Array.Length; i++)          
{
    int temporary = Array[i].Length;
    if (temporary <= 3)
    {
        ArrayLength++;
    }
}
```
Создаем новый массив, как длинну указываем переменную ```ArrayLength``` 
```
string [] temporarilyArray = new string[ArrayLength];
```
Создаем переменную ```index``` она понадобится для наполнения нового массива.
```
int index = 0;
```
Снова используем цикл ```For``` перебирая массив ```originalArray``` отдавая каждый элемент методу ```Length``` для дальнейшей сортировки с помощью ```if ``` как и в прошлый раз, но теперь все слова с тремя или менее знаками мы будем присваивать в новый массив ```temporarilyArray``` где положение будет определять переменная ```index``` значение которой в свою очередь будет увеличиваться на 1 после каждого присвоения.
```
for (int i = 0; i <= Array.Length - 1; i++)          
{
    int temporary = Array[i].Length;
    if (temporary <= 3)
    {
        temporarilyArray[index] = Array[i];
        index+= 1;
    }
}
```
Выводим результат из метода 
```
return temporarilyArray;
```
Таким образом получаем массив ```finishedArray``` в котором все строки равны трем символам или меньше

Для того чтобы вывести элементы массива в терминал используем метод ```printArrey``` 
```
printArrey(finishedArray);
```
### Описание функции
Функция получает массив ```printArrey``` и пропускает его через цикл ```for``` выводя каждый элемент массива в терминал через пробел.
```
void printArrey(string[] Arrey)
{
    for (int i = 0; i < Arrey.Length; i++)
    {
        System.Console.Write(Arrey[i] + " ");
    }
}
```